function img = Test_Image()
img = zeros(1024, 1024);

for x = 1:1024
    for y = 1:1024
        % 生成第一个椭圆
        x_1 = 160;
        y_1 = 540;
        a_1 = 144;
        b_1 = 320;
        L1 = ((x - x_1)^2) / a_1^2 + ((y - y_1)^2) / b_1^2;
        
        if (L1 < 1)
            img(x, y) = 0.25;
        end
        
        % 生成第二个椭圆
        x_2 = 320;
        y_2 = 540;
        a_2 = 144;
        b_2 = 256;
        L2 = ((x - x_2)^2) / a_2^2 + ((y - y_2)^2) / b_2^2;
        
        if (L2 < 1)
            img(x, y) = 0.5;
        end
        
        % 生成三角形
        x_3 = 540;
        y_3 = 420;
        a_3 = 360;
        b_3 = 360;
        L3 = abs(x - x_3) / a_3 + abs(y - y_3) / b_3;
        
        if (L3 < 1 && x > x_3 && y < y_3)
            img(x, y) = 1;
        end
        
    end
end

% 生成十字形
x_4 = 720;
y_4 = 720;
W = 40;
L = 400;
img(x_4 - W / 2:x_4 + W / 2, y_4 - L / 2:y_4 + L / 2) = 1;
img(y_4 - L / 2:y_4 + L / 2, x_4 - W / 2:x_4 + W / 2) = 1;
end
